АлогистикТест2/src/Catalogs/алк_Простой/алк_Простой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_Простой</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СтруктураПоГруппам</name>
      <description>Структура по группам</description>
    </items>
    <items>
      <name>СтруктураПоТипам</name>
      <description>Структура по типам</description>
    </items>
  </predefined>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.алк_Цеха</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>МашинныйЦентр</name>
    <type>
      <types>CatalogRef.алк_МашинныйЦентр</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>CatalogRef.алк_ПодтипПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подтип1</name>
    <type>
      <types>CatalogRef.алк_ПодтипПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подтип2</name>
    <type>
      <types>CatalogRef.алк_ПодтипПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подтип25</name>
    <type>
      <types>CatalogRef.алк_ПодтипПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подтип3</name>
    <type>
      <types>CatalogRef.алк_ПодтипПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Узел</name>
    <type>
      <types>CatalogRef.алк_УзелУчастка</types>
    </type>
  </attributes>
  <attributes>
    <name>Служба</name>
    <type>
      <types>CatalogRef.алк_Службы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПростоя</name>
    <type>
      <types>CatalogRef.алк_ВидПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПростоя</name>
    <type>
      <types>CatalogRef.алк_ТипПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>IdleReasonID</name>
    <comment>Для обмена с Оптимониторингом</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/алк_Простой/Forms/ФормаГруппы/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 	
	
	ДанныеГруппы = НайтиКорень(Объект, 0); 
	
	Элементы.Цех.Видимость 				= Ложь;  // 2
	Элементы.Участок.Видимость 			= Ложь;  // 3 
	Элементы.МашинныйЦентр.Видимость	= Ложь;  // 4
	Элементы.Тип.Видимость 				= Ложь;  // 5
	Элементы.Подтип1.Видимость 			= Ложь;  // 6
	Элементы.Подтип2.Видимость 			= Ложь;  // 7
	Элементы.Подтип25.Видимость 		= Ложь;  // 8
	
	Если ДанныеГруппы["Родитель"]= Справочники.алк_Простой.СтруктураПоГруппам Тогда  	
		Возврат;	
	КонецЕсли;  
	
	// определяем видимость реквизитов
	
	УровеньГруппы = ДанныеГруппы["УровеньГруппы"]; 
	
				
	//Если УровеньГруппы = 2 Тогда 
	//	Элементы.Цех.Видимость = Истина;
	//	Элементы.Наименование.ТолькоПросмотр = Истина; 		  	
	//КонецЕсли;
	//
	//Если УровеньГруппы = 3 Тогда 
	//	Элементы.Участок.Видимость = Истина;
	//	Элементы.Наименование.ТолькоПросмотр = Истина
	//КонецЕсли;
	//
	//Если УровеньГруппы = 4 Тогда 
	//	Элементы.МашинныйЦентр.Видимость = Истина;
	//	Элементы.Наименование.ТолькоПросмотр = Истина;
	//КонецЕсли;
	
	Если УровеньГруппы = 2 Тогда   //5
		Элементы.Тип.Видимость = Истина;
		Элементы.Наименование.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
	Если УровеньГруппы = 3 Тогда  //6
		Элементы.Подтип1.Видимость = Истина;
		Элементы.Наименование.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если УровеньГруппы = 4 Тогда  //7
		Элементы.Подтип2.Видимость = Истина;
		Элементы.Наименование.ТолькоПросмотр = Истина;
	КонецЕсли;  
	
	Если УровеньГруппы = 5 Тогда  //8
		Элементы.Подтип25.Видимость = Истина;
		Элементы.Наименование.ТолькоПросмотр = Истина;
	КонецЕсли;    
	
	
	
	////////////////
	
	Если ЗначениеЗаполнено(Объект.Родитель.Тип) Тогда		
		Объект.Тип = Объект.Родитель.Тип;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Родитель.Подтип1) Тогда		
		Объект.Подтип1 = Объект.Родитель.Подтип1;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Родитель.Подтип2) Тогда		
		Объект.Подтип2 = Объект.Родитель.Подтип2;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Родитель.Подтип25) Тогда		
		Объект.Подтип25 = Объект.Родитель.Подтип25;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция НайтиКорень(Элем, УровеньГруппы)
	
	УровеньГруппы = УровеньГруппы + 1; 
	
	ДанныеГруппы = Новый Соответствие;
		
	Если НЕ ЗначениеЗаполнено(Элем.Родитель) Тогда 	
		
		ДанныеГруппы.Вставить("Родитель", Элем);
		ДанныеГруппы.Вставить("УровеньГруппы", УровеньГруппы);
		
        Возврат ДанныеГруппы;
		
	Иначе
		
		Возврат НайтиКорень(Элем.Родитель, УровеньГруппы);
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура РеквизитПриИзменении(Элемент) 
	
	Объект.Наименование = Элемент.ВыделенныйТекст;	
	
КонецПроцедуры
